Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/prison_system/prisons_introduction.html.txt.tmx
Source language: en
Languages: ga

source: The section on the prison system describes the different prisons and places of detention in the state
ga: Sa roinn seo déantar cur síos ar na priosuin agus aiteanna coinneala difriúil sa stáit

source: • the Sex Offenders Treatment Programmes
ga: • Cláracha Cóir Leighis do Chiontóirí Gnéis

source: • Remission and Temporary Release
ga: • Nuair a chuirtear Breith ar Leataobh agus Scaoileadh Saor Sealadach

source: • the Parole Board of Ireland
ga: • An Bord Parúil na hÉireann

source: Information is also provided on Irish prisoners overseas, on visiting someone in prison and on supports for prisoners' families
ga: Cuirtear eolas ar fáil freisin ar phríosúnaigh Éireannacha thar lear, ar cuairt duine éigin i bpríosún agus ar thacaíochtaí do theaghlaigh na bpríosúnach

source: The detention of children and young people is described in our section on children and young offenders
ga: Tá an coinneáil páistí agus daoine óga cur síos inár rannóg ar leanaí agus ciontóirí óga
